preq.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inf="http://infocomercial.cifin.asobancaria.com" xmlns:dto="http://dto.infocomercial.cifin.asobancaria.com" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
  <soap-env:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
<SignedInfo>
<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<Reference URI="#id-4f56a455-c992-4007-bc27-77b33560c83d">
<Transforms>
<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</Transforms>
<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<DigestValue>CmClqnv+oPopjQ89pc89UD84k2Q=</DigestValue>
</Reference>
<Reference URI="#id-5bf61905-0d27-42ab-942b-3018755d10d4">
<Transforms>
<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</Transforms>
<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<DigestValue>08DeVLxKRlk/nxczprwZcoajRqE=</DigestValue>
</Reference>
</SignedInfo>
<SignatureValue>HPfSbB/OwJ4AH0/djEUr+LG2lKkcg+B3mgRKH53VEsWqfZXLGS2qOtzaIl1tCF3i
XnvDWe0qZf57Qv/wnqjzLWWlh/mVdhy3lBsFg9JO3W3QGnLgWRWxaKCxNEtIehj2
yK7OfwJBu8T8e3aoRbb4JV1gSjZNgSgKJHSJZ34iZ3bZjpG1bOxsEOLbx/fAy+gG
61ezI8Hyn+OwjWspGzpN4JyT01eWemVxrF5vbeaZCdtmq2KlkM+eJI0BYgTQ0xtD
M4x1b8ewLbj63EkYRI4xUB/xf6lJDpj6x4izAZE/Whl3+q4eJ/eXmcrFqe50JueL
P5f5isXMXQo4C6w2dnX8QRm08xSpBOKW51SdqDqUnVyxI5CsXyoym2GHkm08C1BT
F0whxsdzB1BCaz/loTZPr68w4xu3+fviaxhfTE0Z9s7pfxODrwhnaryVqx+P0I54
N8oleCc43lfys4w0f32hEqkdF+KxZOATZhxpqlWjsRm3WPgNVOuNfuvJesFASgOe
pnd9tVrLkWPM+9qRwPRhWzZrhwwcwwMwrj1EHC6yABIVwDHfcaC0ZQmr0lbh+U3k
G0faHLuXNh+Q+0iit2LOmPaBMdMZcf7W/Ln0RiIuZuT+OZJa+61CrOkXxD/o2MpA
aX7RtDNAdxc3bQFCrKufIHQ6vJRX+y/lcHj0BUyHBh8=</SignatureValue>
<KeyInfo>
<wsse:SecurityTokenReference><X509Data>
<X509IssuerSerial>
<X509IssuerName>CN=*.crediscore.co</X509IssuerName>
<X509SerialNumber>701958465195975363928029716549400644846424809112</X509SerialNumber>
</X509IssuerSerial>
</X509Data>
</wsse:SecurityTokenReference></KeyInfo>
</Signature>
      <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-5bf61905-0d27-42ab-942b-3018755d10d4">
        <wsu:Created>2022-12-12T08:47:13Z</wsu:Created>
        <wsu:Expires>2022-12-12T11:47:13Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
  </soap-env:Header>
  <soap-env:Body xmlns:ns0="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" ns0:Id="id-4f56a455-c992-4007-bc27-77b33560c83d">
    <inf:consultaXml>
      <parametrosConsulta>
        <codigoInformacion>1855</codigoInformacion>
        <motivoConsulta>24</motivoConsulta>
        <numeroIdentificacion>37685317</numeroIdentificacion>
        <primerApellido xsi:nil="true"/>
        <tipoIdentificacion>1</tipoIdentificacion>
      </parametrosConsulta>
    </inf:consultaXml>
  </soap-env:Body>
</soap-env:Envelope>