req.xml

<soapenv:Envelope xmlns:inf="http://infocomercial.cifin.asobancaria.com" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Timestamp wsu:Id="TS-5A307D5C4ABC318C0D167074668049348"><wsu:Created>2022-12-11T08:18:00.493Z</wsu:Created><wsu:Expires>2022-12-11T11:04:40.493Z</wsu:Expires></wsu:Timestamp><ds:Signature Id="SIG-5A307D5C4ABC318C0D167074668047647" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="inf soapenv xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-5A307D5C4ABC318C0D167074668047346"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="inf xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>XCHDzVuCWNJ/+dQeQu4AGQ/K/g0=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>u5VhErk7IezUt9TcztfWQ1+4BqKbP+Vl3MqVyWVGbR6Pkl64KsXt0iSTPOZRTS+wEe+7Awu2vGDDeecMKneeO3srWaOgDKGeoA/hSUjmz5jtVb8IGizs2l9GXL4Q9j4E9xFbXAigkAheVls+Naz4UIE7FRni+Vg5qeoeb9mRcTr/y7CX1owyssaxdsHaBTDuppaqtkEBew9sy0IzELFmdg0suSLVx1NRMM+wQGh62jmuuQ0R6HO00GU5RlTzTY6P/PpF9Flw5wEsOeYs1OwF8ZTwW3MMPp+jSieQI4wgmUMXVw7RdZZo1Nd8UN4USTcoO5MplIiRF3CPhAPIWsGAgImG5tU9rh2uwyUqyN555wEmUS019hr6ckrdEPoeqLElF/N6cYy3ADKqZFWzdOE/hk1EhwtVkFpC/Eif7O+RQrpME5xksbAZibHwuFc0kJe/QD6iLU+gOSxPd8lKhATzsF8OBd7/jBh0TSW9ccdtRvPIw04AloEsX+kOZeRNnTn4SiKQn6a4sgyuN8JmoT+isOxoSvrgMg94T+mvxezxdxiq/6i4Hu2h/P1KMiibm/BRSf8VYJRSLlprKfZds1ufomUc0LqC4HOSWfaLa8vuzd3BcNk4LLZ+b/j+h3UEtqdH8G8HjuREkn9FXfd48tYWT/t9cqH/WeJfgodwKtCqHZc=</ds:SignatureValue><ds:KeyInfo Id="KI-5A307D5C4ABC318C0D167074668047344"><wsse:SecurityTokenReference wsu:Id="STR-5A307D5C4ABC318C0D167074668047345"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=*.crediscore.co</ds:X509IssuerName><ds:X509SerialNumber>701958465195975363928029716549400644846424809112</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header><soapenv:Body wsu:Id="id-5A307D5C4ABC318C0D167074668047346" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><inf:consultaXml soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><in0 xsi:type="dto:ParametrosConsultaDTO" xmlns:dto="http://dto.infocomercial.cifin.asobancaria.com"><codigoInformacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">1855</codigoInformacion><motivoConsulta xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">24</motivoConsulta><numeroIdentificacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37685317</numeroIdentificacion><tipoIdentificacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">1</tipoIdentificacion></in0></inf:consultaXml></soapenv:Body></soapenv:Envelope>
